/* description for query finished growl notification */
"%@" = "%@";

/* Text showing how many rows are selected */
"%d of %d rows selected" = "%1$d of %2$d rows selected";

/* Text showing how many rows are in the result */
"%d rows" = "%d rows";

/* message of panel when not all selected fields have been deleted */
"%d rows have not been removed. Reload the table to be sure that the rows exist and use a primary key for your table." = "%d rows have not been removed. Reload the table to be sure that the rows exist and use a primary key for your table.";

/* text showing how many rows are in the result */
"%d rows in table" = "%d rows in table";

/* text showing how many rows are in the filtered result */
"%d rows of %d selected" = "%1$d rows of %2$d selected";

/* text showing how many rows have been affected by multiple queries */
"%i rows affected in total, by %i queries taking %@" = "%1$i rows affected in total, by %2$i queries taking %3$@";

/* text showing how many rows have been affected by a single query */
"%i rows affected, taking %@" = "%1$i rows affected, taking %2$@";

/* value shown for hidden blob and text fields */
"(not loaded)" = "(not loaded)";

/* warning shown in the console when no rows have been affected after writing to the db */
"/* WARNING %@ No rows have been affected */\n" = "/* WARNING %@ No rows have been affected */\n";

/* text showing one row has been affected by multiple queries */
"1 row affected in total, by %i queries taking %@" = "1 row affected in total, by %1$i queries taking %2$@";

/* text showing one row has been affected by a single query */
"1 row affected, taking %@" = "1 row affected, taking %@";

/* error text when reading of csv file gave errors */
"[ERROR in line %d] %@\n" = "[ERROR in line %1$d] %2$@\n";

/* error text when multiple custom query failed */
"[ERROR in query %d] %@\n" = "[ERROR in query %1$d] %2$@\n";

/* error text when trying to import csv data, but we have no tables in the db */
"[ERROR] %@\n" = "[ERROR] %@\n";

/* menu item to add db */
"Add Database..." = "Add Database...";

/* No comment provided by engineer. */
"Alerts" = "Alerts";

/* error changing table collation informative message */
"An error occurred when trying to change the table collation to '%@'.\n\nMySQL said: %@" = "An error occurred when trying to change the table collation to '%1$@'.\n\nMySQL said: %2$@";

/* error changing table encoding informative message */
"An error occurred when trying to change the table encoding to '%@'.\n\nMySQL said: %@" = "An error occurred when trying to change the table encoding to '%1$@'.\n\nMySQL said: %2$@";

/* error changing table type informative message */
"An error occurred when trying to change the table to '%@' from '%@'.\n\nMySQL said: %@" = "An error occurred when trying to change the table to '%1$@' from '%2$@'.\n\nMySQL said: %3$@";

/* error changing table type informative message */
"An error occurred when trying to change the table type to '%@'.\n\nMySQL said: %@" = "An error occurred when trying to change the table type to '%1$@'.\n\nMySQL said: %2$@";

/* error changing table comment informative message */
"An error occurred when trying to change the table's comment to '%@'.\n\nMySQL said: %@" = "An error occurred when trying to change the table's comment to '%1$@'.\n\nMySQL said: %2$@";

/* delete all rows informative message */
"Are you sure you want to delete all the rows from this table. This action cannot be undone." = "Are you sure you want to delete all the rows from this table. This action cannot be undone.";

/* delete table/view informative message */
"Are you sure you want to delete the %@ '%@'. This operation cannot be undone." = "Are you sure you want to delete the %1$@ '%2$@'. This operation cannot be undone.";

/* delete database informative message */
"Are you sure you want to delete the database '%@'. This operation cannot be undone." = "Are you sure you want to delete the database '%@'. This operation cannot be undone.";

/* delete field informative message */
"Are you sure you want to delete the field '%@'? This action cannot be undone." = "Are you sure you want to delete the field '%@'? This action cannot be undone.";

/* delete index informative message */
"Are you sure you want to delete the index '%@'? This action cannot be undone." = "Are you sure you want to delete the index '%@'? This action cannot be undone.";

/* delete tables/views informative message */
"Are you sure you want to delete the selected %@. This operation cannot be undone." = "Are you sure you want to delete the selected %@. This operation cannot be undone.";

/* delete rows informative message */
"Are you sure you want to delete the selected %d rows from this table. This action cannot be undone." = "Are you sure you want to delete the selected %d rows from this table. This action cannot be undone.";

/* delete selected relation informative message */
"Are you sure you want to delete the selected relations? This action cannot be undone" = "Are you sure you want to delete the selected relations? This action cannot be undone";

/* delete selected row informative message */
"Are you sure you want to delete the selected row from this table. This action cannot be undone." = "Are you sure you want to delete the selected row from this table. This action cannot be undone.";

/* No comment provided by engineer. */
"Auto Update" = "Auto Update";

/* toolbar item label for switching to the Table Content tab */
"Browse & Edit Table Content" = "Browse & Edit Table Content";

/* cancel button */
"Cancel" = "Cancel";

/* empty query informative message */
"Cannot save an empty query." = "Cannot save an empty query.";

/* check table menu item */
"Check Table" = "Check Table";

/* check view menu item */
"Check View" = "Check View";

/* menu item for choose db */
"Choose Database..." = "Choose Database...";

/* toolbar item for clear console */
"Clear Console" = "Clear Console";

/* tooltip for toolbar item for clear console */
"Clear the console which shows all MySQL commands performed by Sequel Pro" = "Clear the console which shows all MySQL commands performed by Sequel Pro";

/* description for connected growl notification */
"Connected to %@" = "Connected to %@";

/* message of panel when connection to db failed */
"Connected to host, but unable to connect to database %@.\n\nBe sure that the database exists and that you have the necessary privileges.\n\nMySQL said: %@" = "Connected to host, but unable to connect to database %1$@.\n\nBe sure that the database exists and that you have the necessary privileges.\n\nMySQL said: %2$@";

/* connection failed */
"Connection failed!" = "Connection failed!";

/* popup menuitem for field CONTAINS value */
"contains" = "contains";

/* popup menuitem for field CONTAINS NOT value */
"contains not" = "contains not";

/* toolbar item label for switching to the Table Content tab */
"Content" = "Content";

/* continue button */
"Continue" = "Continue";

/* Copy as RTF */
"Copy as RTF" = "Copy as RTF";

/* copy create func syntax menu item */
"Copy Create Function Syntax" = "Copy Create Function Syntax";

/* copy create proc syntax menu item */
"Copy Create Procedure Syntax" = "Copy Create Procedure Syntax";

/* copy create table syntax menu item */
"Copy Create Table Syntax" = "Copy Create Table Syntax";

/* copy create view syntax menu item */
"Copy Create View Syntax" = "Copy Create View Syntax";

/* Error when we can't parse/split file as CSV */
"Could not parse file as CSV" = "Could not parse file as CSV";

/* message of panel when field cannot be added */
"Couldn't add field %@.\nMySQL said: %@" = "Couldn't add field %1$@.\nMySQL said: %2$@";

/* message of panel when index cannot be created */
"Couldn't add index.\nMySQL said: %@" = "Couldn't add index.\nMySQL said: %@";

/* message of panel when table cannot be created with the given name */
"Couldn't add table %@.\nMySQL said: %@" = "Couldn't add table %1$@.\nMySQL said: %2$@";

/* message of panel when field cannot be changed */
"Couldn't change field %@.\nMySQL said: %@" = "Couldn't change field %1$@.\nMySQL said: %2$@";

/* message of panel when table cannot be created */
"Couldn't create '%@'.\nMySQL said: %@" = "Couldn't create '%1$@'.\nMySQL said: %2$@";

/* message of panel when creation of db failed */
"Couldn't create database.\nMySQL said: %@" = "Couldn't create database.\nMySQL said: %@";

/* message of panel when an item cannot be renamed */
"Couldn't duplicate '%@'.\nMySQL said: %@" = "Couldn't duplicate '%1$@'.\nMySQL said: %2$@";

/* message of panel when flushing privs failed */
"Couldn't flush privileges.\nMySQL said: %@" = "Couldn't flush privileges.\nMySQL said: %@";

/* message of panel when table information cannot be retrieved */
"Couldn't get create syntax.\nMySQL said: %@" = "Couldn't get create syntax.\nMySQL said: %@";

/* message of panel when loading of row failed */
"Couldn't load the row. Reload the table to be sure that the row exists and use a primary key for your table." = "Couldn't load the row. Reload the table to be sure that the row exists and use a primary key for your table.";

/* message of panel when field cannot be added in drag&drop operation */
"Couldn't move field. MySQL said: %@" = "Couldn't move field. MySQL said: %@";

/* Couldn't read the file content of */
"Couldn't read the file content of" = "Couldn't read the file content of";

/* message of panel when an item cannot be removed */
"Couldn't remove '%@'.\nMySQL said: %@" = "Couldn't remove '%1$@'.\nMySQL said: %2$@";

/* message of panel when removing db failed */
"Couldn't remove database.\nMySQL said: %@" = "Couldn't remove database.\nMySQL said: %@";

/* message of panel when field cannot be removed */
"Couldn't remove field %@.\nMySQL said: %@" = "Couldn't remove field %1$@.\nMySQL said: %2$@";

/* message of panel when index cannot be removed */
"Couldn't remove index.\nMySQL said: %@" = "Couldn't remove index.\nMySQL said: %@";

/* message of panel when field cannot be removed */
"Couldn't remove rows.\nMySQL said: %@" = "Couldn't remove rows.\nMySQL said: %@";

/* message of panel when table cannot be removed */
"Couldn't remove table.\nMySQL said: %@" = "Couldn't remove table.\nMySQL said: %@";

/* message of panel when an item cannot be renamed */
"Couldn't rename '%@'.\nMySQL said: %@" = "Couldn't rename '%1$@'.\nMySQL said: %2$@";

/* message of panel when file cannot be replaced */
"Couldn't replace the file. Be sure that you have the necessary privileges." = "Couldn't replace the file. Be sure that you have the necessary privileges.";

/* message of panel when sorting of table failed */
"Couldn't sort table. MySQL said: %@" = "Couldn't sort table. MySQL said: %@";

/* message of panel when error while adding row to db */
"Couldn't write row.\nMySQL said: %@" = "Couldn't write row.\nMySQL said: %@";

/* message of panel when file cannot be written */
"Couldn't write to file. Be sure that you have the necessary privileges." = "Couldn't write to file. Be sure that you have the necessary privileges.";

/* message of panel when no db name is given */
"Database must have a name." = "Database must have a name.";

/* delete button */
"Delete" = "Delete";

/* delete table/view message */
"Delete %@ '%@'?" = "Delete %1$@ '%2$@'?";

/* delete all rows message */
"Delete all rows?" = "Delete all rows?";

/* delete database message */
"Delete database '%@'?" = "Delete database '%@'?";

/* delete field message */
"Delete field?" = "Delete field?";

/* delete index message */
"Delete Index?" = "Delete Index?";

/* delete relation message */
"Delete relation" = "Delete relation";

/* delete rows message */
"Delete rows?" = "Delete rows?";

/* delete tables/views message */
"Delete selected %@?" = "Delete selected %@?";

/* delete selected row message */
"Delete selected row?" = "Delete selected row?";

/* description for disconnected growl notification */
"Disconnected from %@" = "Disconnected from %@";

/* text for csv import drop downs */
"Do not import" = "Do not import";

/* message of panel asking for confirmation for inserting large text from dragging action */
"Do you really want to proceed with %.1f MB of data?" = "Do you really want to proceed with %.1f MB of data?";

/* text showing that app is writing dump */
"Dumping..." = "Dumping...";

/* duplicate object message */
"Duplicate %@ '%@' to:" = "Duplicate %1$@ '%2$@' to:";

/* duplicate func menu title */
"Duplicate function" = "Duplicate function";

/* duplicate proc menu title */
"Duplicate procedure" = "Duplicate procedure";

/* duplicate table menu title */
"Duplicate table" = "Duplicate table";

/* duplicate view menu title */
"Duplicate view" = "Duplicate view";

/* toolbar item label for switching to the Table Structure tab */
"Edit Table Structure" = "Edit Table Structure";

/* message of panel when no name is given for an item */
"Empty names are not allowed." = "Empty names are not allowed.";

/* empty query message */
"Empty query" = "Empty query";

/* Error
   error */
"Error" = "Error";

/* error changing table collation message */
"Error changing table collation" = "Error changing table collation";

/* error changing table comment message */
"Error changing table comment" = "Error changing table comment";

/* error changing table encoding message */
"Error changing table encoding" = "Error changing table encoding";

/* error changing table type message */
"Error changing table type" = "Error changing table type";

/* error creating relation message */
"Error creating relation" = "Error creating relation";

/* execution stopped message */
"Execution stopped!\n" = "Execution stopped!\n";

/* text showing that app is exporting to text file */
"Exporting..." = "Exporting...";

/* No comment provided by engineer. */
"Fatal Error" = "Fatal Error";

/* No comment provided by engineer. */
"Favorites" = "Favorites";

/* popup menuitem for field (showing only if disabled) */
"field" = "field";

/* description for finished exporting growl notification */
"Finished exporting to %@" = "Finished exporting to %@";

/* description for finished importing growl notification */
"Finished importing %@" = "Finished importing %@";

/* flush table menu item */
"Flush Table" = "Flush Table";

/* flush view menu item */
"Flush View" = "Flush View";

/* title of panel when successfully flushed privs */
"Flushed Privileges" = "Flushed Privileges";

/* function */
"function" = "function";

/* functions */
"functions" = "functions";

/* No comment provided by engineer. */
"General" = "General";

/* Message for Growl Notifications Alert Dialog */
"growl_prefs_msg" = "growl_prefs_msg";

/* Title for Growl Notifications Alert Dialog */
"growl_prefs_title" = "growl_prefs_title";

/* help topics for */
"Help topics for" = "Help topics for";

/* Hide Console */
"Hide Console" = "Hide Console";

/* insufficient details message */
"Insufficient connection details" = "Insufficient connection details";

/* insufficient details informative message */
"Insufficient details provided to establish a connection. Please provide at least a host or socket." = "Insufficient details provided to establish a connection. Please provide at least a host or socket.";

/* popup menuitem for field IS value */
"is" = "is";

/* popup menuitem for field AFTER DATE value */
"is after" = "is after";

/* popup menuitem for field AFTER OR EQUAL TO value */
"is after or equal to" = "is after or equal to";

/* popup menuitem for field BEFORE DATE value */
"is before" = "is before";

/* popup menuitem for field BEFORE OR EQUAL TO value */
"is before or equal to" = "is before or equal to";

/* popup menuitem for field IS NOT value */
"is not" = "is not";

/* items */
"items" = "items";

/* text showing the number of rows the result is limited to */
"Limited to %d rows starting with row" = "Limited to %d rows starting with row";

/* mysql error message */
"MySQL Error" = "MySQL Error";

/* mysql help */
"MySQL Help" = "MySQL Help";

/* MySQL Help for Selection */
"MySQL Help for Selection" = "MySQL Help for Selection";

/* MySQL Help for Word */
"MySQL Help for Word" = "MySQL Help for Word";

/* mysql help categories */
"MySQL Help – Categories" = "MySQL Help – Categories";

/* No comment provided by engineer. */
"Network" = "Network";

/* text showing that the result isn't limited */
"No limit" = "No limit";

/* OK button */
"OK" = "OK";

/* Only one dragged item allowed. */
"Only one dragged item allowed." = "Only one dragged item allowed.";

/* message of panel when no columns are specified to be indexed */
"Please insert the columns you want to index." = "Please insert the columns you want to index.";

/* procedure */
"procedure" = "procedure";

/* procedures */
"procedures" = "procedures";

/* header for procs & funcs list */
"PROCS & FUNCS" = "PROCS & FUNCS";

/* toolbar item label for switching to the Run Query tab */
"Query" = "Query";

/* query already exists message */
"Query already exists" = "Query already exists";

/* No comment provided by engineer. */
"Query Editor" = "Query Editor";

/* Title of query history popup button */
"Query History…" = "Query History…";

/* text showing that app is reading dump */
"Reading..." = "Reading...";

/* menu item to refresh databases */
"Refresh Databases" = "Refresh Databases";

/* remove func menu title */
"Remove function" = "Remove function";

/* remove functions menu title */
"Remove functions" = "Remove functions";

/* remove items menu title */
"Remove items" = "Remove items";

/* remove proc menu title */
"Remove procedure" = "Remove procedure";

/* remove procedures menu title */
"Remove procedures" = "Remove procedures";

/* remove table menu title */
"Remove table" = "Remove table";

/* remove tables menu title */
"Remove tables" = "Remove tables";

/* remove view menu title */
"Remove view" = "Remove view";

/* remove views menu title */
"Remove views" = "Remove views";

/* rename item name to: */
"Rename %@ '%@' to:" = "Rename %1$@ '%2$@' to:";

/* rename func menu title */
"Rename function" = "Rename function";

/* rename proc menu title */
"Rename procedure" = "Rename procedure";

/* rename table menu title */
"Rename table" = "Rename table";

/* rename view menu title */
"Rename view" = "Rename view";

/* run all button */
"Run All" = "Run All";

/* Title of button to run current query in custom query view */
"Run Current" = "Run Current";

/* Title of action menu item to run current query in custom query view */
"Run Current Query" = "Run Current Query";

/* toolbar item label for switching to the Run Query tab */
"Run Custom Query" = "Run Custom Query";

/* Title of button to run query just before text caret in custom query view */
"Run Previous" = "Run Previous";

/* Title of action menu item to run query just before text caret in custom query view */
"Run Previous Query" = "Run Previous Query";

/* Title of action menu item to run selected text in custom query view */
"Run Selected Text" = "Run Selected Text";

/* Title of button to run selected text in custom query view */
"Run Selection" = "Run Selection";

/* No comment provided by engineer. */
"S_AUTH" = "S_AUTH";

/* No comment provided by engineer. */
"S_CONNECTED" = "S_CONNECTED";

/* No comment provided by engineer. */
"S_CONNECTING" = "S_CONNECTING";

/* No comment provided by engineer. */
"S_IDLE" = "S_IDLE";

/* No comment provided by engineer. */
"S_PORT" = "S_PORT";

/* Search in MySQL Documentation */
"Search in MySQL Documentation" = "Search in MySQL Documentation";

/* Search in MySQL Help */
"Search in MySQL Help" = "Search in MySQL Help";

/* toolbar item for selecting a db */
"Select Database" = "Select Database";

/* No comment provided by engineer. */
"Shortcuts" = "Shortcuts";

/* Show Console */
"Show Console" = "Show Console";

/* show create func syntax menu item */
"Show Create Function Syntax" = "Show Create Function Syntax";

/* show create proc syntax menu item */
"Show Create Procedure Syntax" = "Show Create Procedure Syntax";

/* show create table syntax menu item */
"Show Create Table Syntax" = "Show Create Table Syntax";

/* show create view syntax menu item */
"Show Create View Syntax" = "Show Create View Syntax";

/* show mysql help for */
"Show MySQL help for" = "Show MySQL help for";

/* tooltip for toolbar item for show/hide console */
"Show or hide the console which shows all MySQL commands performed by Sequel Pro" = "Show or hide the console which shows all MySQL commands performed by Sequel Pro";

/* toolbar item for show/hide console */
"Show/Hide Console" = "Show/Hide Console";

/* stop button */
"Stop" = "Stop";

/* toolbar item label for switching to the Table Structure tab */
"Structure" = "Structure";

/* message of panel when successfully flushed privs */
"Successfully flushed privileges." = "Successfully flushed privileges.";

/* tooltip for toolbar item for switching to the Run Query tab */
"Switch to the Run Query tab" = "Switch to the Run Query tab";

/* tooltip for toolbar item for switching to the Table Content tab */
"Switch to the Table Content tab" = "Switch to the Table Content tab";

/* tooltip for toolbar item for switching to the Table Status tab */
"Switch to the Table Status tab" = "Switch to the Table Status tab";

/* tooltip for toolbar item for switching to the Table Structure tab */
"Switch to the Table Structure tab" = "Switch to the Table Structure tab";

/* description for table syntax copied growl notification */
"Syntax for %@ table copied" = "Syntax for %@ table copied";

/* No comment provided by engineer. */
"T_START" = "T_START";

/* No comment provided by engineer. */
"T_STOP" = "T_STOP";

/* table */
"table" = "table";

/* text showing that app is writing data for table dump */
"Table %i of %i (%@): Dumping..." = "Table %1$i of %2$i (%3$@): Dumping...";

/* text showing that app is fetching data for table dump */
"Table %i of %i (%@): Fetching data..." = "Table %1$i of %2$i (%3$@): Fetching data...";

/* text showing that app is fetching data for table dump */
"Table %i of %i (%@): fetching data..." = "Table %1$i of %2$i (%3$@): fetching data...";

/* text showing that app is writing data for table export */
"Table %i of %i (%@): Writing..." = "Table %1$i of %2$i (%3$@): Writing...";

/* header for table info pane */
"TABLE INFORMATION" = "TABLE INFORMATION";

/* message of panel when no name is given for table */
"Table must have a name." = "Table must have a name.";

/* toolbar item label for switching to the Table Status tab */
"Table Status" = "Table Status";

/* header for table list */
"TABLES" = "TABLES";

/* tables */
"tables" = "tables";

/* No comment provided by engineer. */
"Tables" = "Tables";

/* header for table & views list */
"TABLES & VIEWS" = "TABLES & VIEWS";

/* query already exists informative message */
"The query you are adding to your favorites already exists." = "The query you are adding to your favorites already exists.";

/* message of panel when no rows have been affected after writing to the db */
"The row was not written to the MySQL database. You probably haven't changed anything.\nReload the table to be sure that the row exists and use a primary key for your table.\n(This error can be turned off in the preferences.)" = "The row was not written to the MySQL database. You probably haven't changed anything.\nReload the table to be sure that the row exists and use a primary key for your table.\n(This error can be turned off in the preferences.)";

/* error removing relation informative message */
"The selected relation couldn't be removed.\n\nMySQL said: %@" = "The selected relation couldn't be removed.\n\nMySQL said: %@";

/* error creating relation informative message */
"The specified relation was unable to be created.\n\nMySQL said: %@" = "The specified relation was unable to be created.\n\nMySQL said: %@";

/* rename table error informative message */
"The table '%@' was unable to be renamed because an error occurred.\n\nMySQL said: %@" = "The table '%1$@' was unable to be renamed because an error occurred.\n\nMySQL said: %2$@";

/* message of panel when table content cannot be copied */
"There have been errors while copying table content. Please control the new table." = "There have been errors while copying table content. Please control the new table.";

/* text shown when query was successfull */
"There were no errors." = "There were no errors.";

/* message of panel when connection to db failed after selecting from popupbutton */
"Unable to connect to database %@.\nBe sure that you have the necessary privileges." = "Unable to connect to database %@.\nBe sure that you have the necessary privileges.";

/* message of panel when connection to host failed */
"Unable to connect to host %@, or the request timed out.\n\nBe sure that the address is correct and that you have the necessary privileges, or try increasing the connection timeout (currently %i seconds).\n\nMySQL said: %@" = "Unable to connect to host %1$@, or the request timed out.\n\nBe sure that the address is correct and that you have the necessary privileges, or try increasing the connection timeout (currently %2$i seconds).\n\nMySQL said: %3$@";

/* error removing relation message */
"Unable to remove relation" = "Unable to remove relation";

/* rename table error message */
"Unable to rename table" = "Unable to rename table";

/* version */
"version" = "version";

/* view */
"view" = "view";

/* views */
"views" = "views";

/* warning
   Warning */
"Warning" = "Warning";

/* text showing that app is writing text file */
"Writing..." = "Writing...";

/* message of panel when trying to copy multiple rows */
"You can only copy single rows." = "You can only copy single rows.";

/* message of panel when trying to edit tables without index and with hidden blob/text fields */
"You can't hide blob and text fields when working with tables without index." = "You can't hide blob and text fields when working with tables without index.";

